Tekla Open API Reference for Tekla Structures 2025
DrawingSelector Methods
The DrawingSelector type exposes the following members.
Methods
Name | Description
GetSelected
 Gets the drawings that are currently selected in the drawing list dialog.
Top
See Also
Reference
DrawingSelector Class
Tekla.Structures.Drawing.UI Namespace